MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C32D0AGN20000/mcu.h
#define bFM_INTREQ_IRQ16MON_INT0                  *((volatile  uint8_t *)(0x42624880UL))
#define bFM0P_INTREQ_IRQ16MON_INT0                *((volatile  uint8_t *)(0x42624880UL))
#define bFM_INTREQ_IRQ16MON_INT1                  *((volatile  uint8_t *)(0x42624884UL))
#define bFM0P_INTREQ_IRQ16MON_INT1                *((volatile  uint8_t *)(0x42624884UL))
#define bFM_INTREQ_IRQ16MON_INT2                  *((volatile  uint8_t *)(0x42624888UL))
#define bFM0P_INTREQ_IRQ16MON_INT2                *((volatile  uint8_t *)(0x42624888UL))

#define bFM_INTREQ_IRQ17MON_INT0                  *((volatile  uint8_t *)(0x42624900UL))
#define bFM0P_INTREQ_IRQ17MON_INT0                *((volatile  uint8_t *)(0x42624900UL))
#define bFM_INTREQ_IRQ17MON_INT1                  *((volatile  uint8_t *)(0x42624904UL))
#define bFM0P_INTREQ_IRQ17MON_INT1                *((volatile  uint8_t *)(0x42624904UL))
#define bFM_INTREQ_IRQ17MON_INT2                  *((volatile  uint8_t *)(0x42624908UL))
#define bFM0P_INTREQ_IRQ17MON_INT2                *((volatile  uint8_t *)(0x42624908UL))

#define bFM_INTREQ_IRQ18MON_INT0                  *((volatile  uint8_t *)(0x42624980UL))
#define bFM0P_INTREQ_IRQ18MON_INT0                *((volatile  uint8_t *)(0x42624980UL))
#define bFM_INTREQ_IRQ18MON_INT1                  *((volatile  uint8_t *)(0x42624984UL))
#define bFM0P_INTREQ_IRQ18MON_INT1                *((volatile  uint8_t *)(0x42624984UL))
#define bFM_INTREQ_IRQ18MON_INT2                  *((volatile  uint8_t *)(0x42624988UL))
#define bFM0P_INTREQ_IRQ18MON_INT2                *((volatile  uint8_t *)(0x42624988UL))

#define bFM_INTREQ_IRQ19MON_INT0                  *((volatile  uint8_t *)(0x42624A00UL))
#define bFM0P_INTREQ_IRQ19MON_INT0                *((volatile  uint8_t *)(0x42624A00UL))
#define bFM_INTREQ_IRQ19MON_INT1                  *((volatile  uint8_t *)(0x42624A04UL))
#define bFM0P_INTREQ_IRQ19MON_INT1                *((volatile  uint8_t *)(0x42624A04UL))
#define bFM_INTREQ_IRQ19MON_INT2                  *((volatile  uint8_t *)(0x42624A08UL))
#define bFM0P_INTREQ_IRQ19MON_INT2                *((volatile  uint8_t *)(0x42624A08UL))

#define bFM_INTREQ_IRQ20MON_INT0                  *((volatile  uint8_t *)(0x42624A80UL))
#define bFM0P_INTREQ_IRQ20MON_INT0                *((volatile  uint8_t *)(0x42624A80UL))
#define bFM_INTREQ_IRQ20MON_INT1                  *((volatile  uint8_t *)(0x42624A84UL))
#define bFM0P_INTREQ_IRQ20MON_INT1                *((volatile  uint8_t *)(0x42624A84UL))
#define bFM_INTREQ_IRQ20MON_INT2                  *((volatile  uint8_t *)(0x42624A88UL))
#define bFM0P_INTREQ_IRQ20MON_INT2                *((volatile  uint8_t *)(0x42624A88UL))

#define bFM_INTREQ_IRQ21MON_INT0                  *((volatile  uint8_t *)(0x42624B00UL))
#define bFM0P_INTREQ_IRQ21MON_INT0                *((volatile  uint8_t *)(0x42624B00UL))
#define bFM_INTREQ_IRQ21MON_INT1                  *((volatile  uint8_t *)(0x42624B04UL))
#define bFM0P_INTREQ_IRQ21MON_INT1                *((volatile  uint8_t *)(0x42624B04UL))
#define bFM_INTREQ_IRQ21MON_INT2                  *((volatile  uint8_t *)(0x42624B08UL))
#define bFM0P_INTREQ_IRQ21MON_INT2                *((volatile  uint8_t *)(0x42624B08UL))

#define bFM_INTREQ_IRQ22MON_INT0                  *((volatile  uint8_t *)(0x42624B80UL))
#define bFM0P_INTREQ_IRQ22MON_INT0                *((volatile  uint8_t *)(0x42624B80UL))
#define bFM_INTREQ_IRQ22MON_INT1                  *((volatile  uint8_t *)(0x42624B84UL))
#define bFM0P_INTREQ_IRQ22MON_INT1                *((volatile  uint8_t *)(0x42624B84UL))
#define bFM_INTREQ_IRQ22MON_INT2                  *((volatile  uint8_t *)(0x42624B88UL))
#define bFM0P_INTREQ_IRQ22MON_INT2                *((volatile  uint8_t *)(0x42624B88UL))

#define bFM_INTREQ_IRQ23MON_INT0                  *((volatile  uint8_t *)(0x42624C00UL))
#define bFM0P_INTREQ_IRQ23MON_INT0                *((volatile  uint8_t *)(0x42624C00UL))
#define bFM_INTREQ_IRQ23MON_INT1                  *((volatile  uint8_t *)(0x42624C04UL))
#define bFM0P_INTREQ_IRQ23MON_INT1                *((volatile  uint8_t *)(0x42624C04UL))
#define bFM_INTREQ_IRQ23MON_INT2                  *((volatile  uint8_t *)(0x42624C08UL))
#define bFM0P_INTREQ_IRQ23MON_INT2                *((volatile  uint8_t *)(0x42624C08UL))

#define bFM_INTREQ_IRQ24MON_INT0                  *((volatile  uint8_t *)(0x42624C80UL))
#define bFM0P_INTREQ_IRQ24MON_INT0                *((volatile  uint8_t *)(0x42624C80UL))
#define bFM_INTREQ_IRQ24MON_INT1                  *((volatile  uint8_t *)(0x42624C84UL))
#define bFM0P_INTREQ_IRQ24MON_INT1                *((volatile  uint8_t *)(0x42624C84UL))
#define bFM_INTREQ_IRQ24MON_INT2                  *((volatile  uint8_t *)(0x42624C88UL))
#define bFM0P_INTREQ_IRQ24MON_INT2                *((volatile  uint8_t *)(0x42624C88UL))

#define bFM_INTREQ_IRQ25MON_INT0                  *((volatile  uint8_t *)(0x42624D00UL))
#define bFM0P_INTREQ_IRQ25MON_INT0                *((volatile  uint8_t *)(0x42624D00UL))
#define bFM_INTREQ_IRQ25MON_INT1                  *((volatile  uint8_t *)(0x42624D04UL))
#define bFM0P_INTREQ_IRQ25MON_INT1                *((volatile  uint8_t *)(0x42624D04UL))
#define bFM_INTREQ_IRQ25MON_INT2                  *((volatile  uint8_t *)(0x42624D08UL))
#define bFM0P_INTREQ_IRQ25MON_INT2                *((volatile  uint8_t *)(0x42624D08UL))

#define bFM_INTREQ_IRQ26MON_INT0                  *((volatile  uint8_t *)(0x42624D80UL))
#define bFM0P_INTREQ_IRQ26MON_INT0                *((volatile  uint8_t *)(0x42624D80UL))
#define bFM_INTREQ_IRQ26MON_INT1                  *((volatile  uint8_t *)(0x42624D84UL))
#define bFM0P_INTREQ_IRQ26MON_INT1                *((volatile  uint8_t *)(0x42624D84UL))
#define bFM_INTREQ_IRQ26MON_INT2                  *((volatile  uint8_t *)(0x42624D88UL))
#define bFM0P_INTREQ_IRQ26MON_INT2                *((volatile  uint8_t *)(0x42624D88UL))

#define bFM_INTREQ_IRQ27MON_INT0                  *((volatile  uint8_t *)(0x42624E00UL))
#define bFM0P_INTREQ_IRQ27MON_INT0                *((volatile  uint8_t *)(0x42624E00UL))
#define bFM_INTREQ_IRQ27MON_INT1                  *((volatile  uint8_t *)(0x42624E04UL))
#define bFM0P_INTREQ_IRQ27MON_INT1                *((volatile  uint8_t *)(0x42624E04UL))
#define bFM_INTREQ_IRQ27MON_INT2                  *((volatile  uint8_t *)(0x42624E08UL))
#define bFM0P_INTREQ_IRQ27MON_INT2                *((volatile  uint8_t *)(0x42624E08UL))

#define bFM_INTREQ_IRQ28MON_INT0                  *((volatile  uint8_t *)(0x42624E80UL))
#define bFM0P_INTREQ_IRQ28MON_INT0                *((volatile  uint8_t *)(0x42624E80UL))
#define bFM_INTREQ_IRQ28MON_INT1                  *((volatile  uint8_t *)(0x42624E84UL))
#define bFM0P_INTREQ_IRQ28MON_INT1                *((volatile  uint8_t *)(0x42624E84UL))
#define bFM_INTREQ_IRQ28MON_INT2                  *((volatile  uint8_t *)(0x42624E88UL))
#define bFM0P_INTREQ_IRQ28MON_INT2                *((volatile  uint8_t *)(0x42624E88UL))

