MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C32D0AGN20000/mcu.h
#define bFM_INTREQ_IRQ29MON_INT0                  *((volatile  uint8_t *)(0x42624F00UL))
#define bFM0P_INTREQ_IRQ29MON_INT0                *((volatile  uint8_t *)(0x42624F00UL))
#define bFM_INTREQ_IRQ29MON_INT1                  *((volatile  uint8_t *)(0x42624F04UL))
#define bFM0P_INTREQ_IRQ29MON_INT1                *((volatile  uint8_t *)(0x42624F04UL))
#define bFM_INTREQ_IRQ29MON_INT2                  *((volatile  uint8_t *)(0x42624F08UL))
#define bFM0P_INTREQ_IRQ29MON_INT2                *((volatile  uint8_t *)(0x42624F08UL))

#define bFM_INTREQ_IRQ30MON_INT0                  *((volatile  uint8_t *)(0x42624F80UL))
#define bFM0P_INTREQ_IRQ30MON_INT0                *((volatile  uint8_t *)(0x42624F80UL))
#define bFM_INTREQ_IRQ30MON_INT1                  *((volatile  uint8_t *)(0x42624F84UL))
#define bFM0P_INTREQ_IRQ30MON_INT1                *((volatile  uint8_t *)(0x42624F84UL))
#define bFM_INTREQ_IRQ30MON_INT2                  *((volatile  uint8_t *)(0x42624F88UL))
#define bFM0P_INTREQ_IRQ30MON_INT2                *((volatile  uint8_t *)(0x42624F88UL))

#define bFM_INTREQ_IRQ31MON_INT0                  *((volatile  uint8_t *)(0x42625000UL))
#define bFM0P_INTREQ_IRQ31MON_INT0                *((volatile  uint8_t *)(0x42625000UL))
#define bFM_INTREQ_IRQ31MON_INT1                  *((volatile  uint8_t *)(0x42625004UL))
#define bFM0P_INTREQ_IRQ31MON_INT1                *((volatile  uint8_t *)(0x42625004UL))
#define bFM_INTREQ_IRQ31MON_INT2                  *((volatile  uint8_t *)(0x42625008UL))
#define bFM0P_INTREQ_IRQ31MON_INT2                *((volatile  uint8_t *)(0x42625008UL))

#define bFM_INTREQ_ODDPKS_ODDPKS0                 *((volatile  uint8_t *)(0x42620200UL))
#define bFM0P_INTREQ_ODDPKS_ODDPKS0               *((volatile  uint8_t *)(0x42620200UL))
#define bFM_INTREQ_ODDPKS_ODDPKS1                 *((volatile  uint8_t *)(0x42620204UL))
#define bFM0P_INTREQ_ODDPKS_ODDPKS1               *((volatile  uint8_t *)(0x42620204UL))
#define bFM_INTREQ_ODDPKS_ODDPKS2                 *((volatile  uint8_t *)(0x42620208UL))
#define bFM0P_INTREQ_ODDPKS_ODDPKS2               *((volatile  uint8_t *)(0x42620208UL))
#define bFM_INTREQ_ODDPKS_ODDPKS3                 *((volatile  uint8_t *)(0x4262020CUL))
#define bFM0P_INTREQ_ODDPKS_ODDPKS3               *((volatile  uint8_t *)(0x4262020CUL))
#define bFM_INTREQ_ODDPKS_ODDPKS4                 *((volatile  uint8_t *)(0x42620210UL))
#define bFM0P_INTREQ_ODDPKS_ODDPKS4               *((volatile  uint8_t *)(0x42620210UL))


/*******************************************************************************
* LSCRP Registers LSCRP
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* LVD Registers LVD
*   Bitband Section
*******************************************************************************/
#define bFM_LVD_LVD_CLR_LVDCL                     *((volatile  uint8_t *)(0x426A011CUL))
#define bFM0P_LVD_LVD_CLR_LVDCL                   *((volatile  uint8_t *)(0x426A011CUL))
#define bFM_LVD_LVD_CLR_LVD2CL                    *((volatile  uint8_t *)(0x426A013CUL))
#define bFM0P_LVD_LVD_CLR_LVD2CL                  *((volatile  uint8_t *)(0x426A013CUL))

#define bFM_LVD_LVD_CTL_LVDIE                     *((volatile  uint8_t *)(0x426A001CUL))
#define bFM0P_LVD_LVD_CTL_LVDIE                   *((volatile  uint8_t *)(0x426A001CUL))
#define bFM_LVD_LVD_CTL_LVDRE                     *((volatile  uint8_t *)(0x426A003CUL))
#define bFM0P_LVD_LVD_CTL_LVDRE                   *((volatile  uint8_t *)(0x426A003CUL))

#define bFM_LVD_LVD_STR_LVDHSTR                   *((volatile  uint8_t *)(0x426A0080UL))
#define bFM0P_LVD_LVD_STR_LVDHSTR                 *((volatile  uint8_t *)(0x426A0080UL))
#define bFM_LVD_LVD_STR_LVDIR                     *((volatile  uint8_t *)(0x426A009CUL))
#define bFM0P_LVD_LVD_STR_LVDIR                   *((volatile  uint8_t *)(0x426A009CUL))
#define bFM_LVD_LVD_STR_LVD2HSTR                  *((volatile  uint8_t *)(0x426A00A0UL))
#define bFM0P_LVD_LVD_STR_LVD2HSTR                *((volatile  uint8_t *)(0x426A00A0UL))
#define bFM_LVD_LVD_STR_LVD2IR                    *((volatile  uint8_t *)(0x426A00BCUL))
#define bFM0P_LVD_LVD_STR_LVD2IR                  *((volatile  uint8_t *)(0x426A00BCUL))

#define bFM_LVD_LVD_STR2_LVDRRDY                  *((volatile  uint8_t *)(0x426A0218UL))
#define bFM0P_LVD_LVD_STR2_LVDRRDY                *((volatile  uint8_t *)(0x426A0218UL))
#define bFM_LVD_LVD_STR2_LVDIRDY                  *((volatile  uint8_t *)(0x426A021CUL))
#define bFM0P_LVD_LVD_STR2_LVDIRDY                *((volatile  uint8_t *)(0x426A021CUL))
#define bFM_LVD_LVD_STR2_LVD2IRDY                 *((volatile  uint8_t *)(0x426A023CUL))
#define bFM0P_LVD_LVD_STR2_LVD2IRDY               *((volatile  uint8_t *)(0x426A023CUL))


/*******************************************************************************
* MFS Registers MFS0
*   Bitband Section
*******************************************************************************/
#define bFM_MFS0_CSIO_ESCR_CSFE                   *((volatile  uint8_t *)(0x42700094UL))
#define bFM0P_MFS0_CSIO_ESCR_CSFE                 *((volatile  uint8_t *)(0x42700094UL))
#define bFM_MFS0_CSIO_ESCR_L3                     *((volatile  uint8_t *)(0x42700098UL))
#define bFM0P_MFS0_CSIO_ESCR_L3                   *((volatile  uint8_t *)(0x42700098UL))
#define bFM_MFS0_CSIO_ESCR_SOP                    *((volatile  uint8_t *)(0x4270009CUL))
#define bFM0P_MFS0_CSIO_ESCR_SOP                  *((volatile  uint8_t *)(0x4270009CUL))

#define bFM_MFS0_CSIO_FCR_FE1                     *((volatile  uint8_t *)(0x42700280UL))
#define bFM0P_MFS0_CSIO_FCR_FE1                   *((volatile  uint8_t *)(0x42700280UL))
#define bFM_MFS0_CSIO_FCR_FE2                     *((volatile  uint8_t *)(0x42700284UL))
#define bFM0P_MFS0_CSIO_FCR_FE2                   *((volatile  uint8_t *)(0x42700284UL))
#define bFM_MFS0_CSIO_FCR_FCL1                    *((volatile  uint8_t *)(0x42700288UL))
#define bFM0P_MFS0_CSIO_FCR_FCL1                  *((volatile  uint8_t *)(0x42700288UL))
#define bFM_MFS0_CSIO_FCR_FCL2                    *((volatile  uint8_t *)(0x4270028CUL))
#define bFM0P_MFS0_CSIO_FCR_FCL2                  *((volatile  uint8_t *)(0x4270028CUL))
#define bFM_MFS0_CSIO_FCR_FSET                    *((volatile  uint8_t *)(0x42700290UL))
#define bFM0P_MFS0_CSIO_FCR_FSET                  *((volatile  uint8_t *)(0x42700290UL))
#define bFM_MFS0_CSIO_FCR_FLD                     *((volatile  uint8_t *)(0x42700294UL))
#define bFM0P_MFS0_CSIO_FCR_FLD                   *((volatile  uint8_t *)(0x42700294UL))
#define bFM_MFS0_CSIO_FCR_FLST                    *((volatile  uint8_t *)(0x42700298UL))
#define bFM0P_MFS0_CSIO_FCR_FLST                  *((volatile  uint8_t *)(0x42700298UL))
#define bFM_MFS0_CSIO_FCR_FSEL                    *((volatile  uint8_t *)(0x427002A0UL))
#define bFM0P_MFS0_CSIO_FCR_FSEL                  *((volatile  uint8_t *)(0x427002A0UL))
#define bFM_MFS0_CSIO_FCR_FTIE                    *((volatile  uint8_t *)(0x427002A4UL))
#define bFM0P_MFS0_CSIO_FCR_FTIE                  *((volatile  uint8_t *)(0x427002A4UL))
#define bFM_MFS0_CSIO_FCR_FDRQ                    *((volatile  uint8_t *)(0x427002A8UL))
#define bFM0P_MFS0_CSIO_FCR_FDRQ                  *((volatile  uint8_t *)(0x427002A8UL))
#define bFM_MFS0_CSIO_FCR_FRIIE                   *((volatile  uint8_t *)(0x427002ACUL))
#define bFM0P_MFS0_CSIO_FCR_FRIIE                 *((volatile  uint8_t *)(0x427002ACUL))
#define bFM_MFS0_CSIO_FCR_FLSTE                   *((volatile  uint8_t *)(0x427002B0UL))
#define bFM0P_MFS0_CSIO_FCR_FLSTE                 *((volatile  uint8_t *)(0x427002B0UL))

